Repository: openstack-archive/sahara-plugin-mapr
Catalog: sahara_plugin_mapr/locale/*/LC_MESSAGES/sahara_plugin_mapr.po
Languages: id

source: %(message)s, required by %(required_by)s
id: %(message)s, diperlukan oleh %(required_by)s

source: %(service)s service cannot be installed alongside %(package)s package
id: Layanan %(service)s tidak dapat diinstal bersama paket %(package)s

source: %s is in running state
id: %s dalam keadaan berjalan

source: %s is not in running state
id: %s tidak dalam keadaan berjalan

source: %s must have at least 1 volume or ephemeral drive
id: %s harus memiliki setidaknya 1 volume atau drive sesaat (ephemeral drive)

source: CLDB failed to start
id: CLDB gagal memulai

source: Can not map service
id: Tidak dapat memetakan layanan

source: Config '%s' missing 'value'
id: Konfigurasi '%s' nilai hilang (missing 'value')

source: Config missing 'name'
id: Konfigurasi 'nama' hilang (missing 'name')

source: Configure SSH connection
id: Konfigurasikan koneksi SSH

source: Configure cluster topology
id: Konfigurasikan topologi kluster

source: Configure database
id: Konfigurasikan database

source: Create Sentry role for Hive
id: Buat peran Sentry untuk Hive

source: Execute configure.sh
id: Jalankan configure.sh

source: Hadoop cluster should contain at least %(expected_count)d %(component)s component(s). Actual %(component)s count is %(actual_count)d
id: Hadoop cluster harus mengandung setidaknya %(expected_count)d %(component)s component(s). Actual %(component)s count adalah %(actual_count)d

source: Hadoop cluster should contain at most %(expected_count)d %(component)s component(s). Actual %(component)s count is %(actual_count)d
id: Hadoop cluster harus mengandung paling banyak %(expected_count)d %(component)s component(s). Actual %(component)s count adalah %(actual_count)d

source: Hadoop cluster should contain odd number of %(component)s but %(actual_count)s found.
id: Hadoop cluster harus berisi jumlah ganjil %(component)s but %(actual_count)s ditemukan.

source: Init Sentry DB schema
id: Skema Init Sentry DB

source: Initializing MapR-FS
id: Menginisialisasi MapR-FS

source: Install %s service
id: Instal layanan %s

source: Install Java
id: Instal Java

source: Install MapR repositories
id: Instal repositori MapR

source: Install MySQL client
id: Instal klien MySQL

source: Install Scala
id: Instal Scala

source: Install security repos
id: Instal repo keamanan (security repos)

source: Invalid argument type %s
id: Jenis argumen tidak valid %s

source: Migrating Hue database
id: Memigrasi database Hue

source: Node "%(ng_name)s" is missing component %(component)s
id: Node "%(ng_name)s" tidak ada komponen %(component)s

source: Node failed to connect to CLDB: %s
id: Node gagal terhubung ke CLDB: %s

source: Rebuilt Oozie war
id: Membangun kembali perang Oozie (Oozie war)

source: Service %(service)s requires %(os)s OS. Use %(os)s image and add "%(os)s" tag to it.
id: Service %(service)s membutuhkan %(os)s OS. Gunakan %(os)s image dan tambahkan tag "%(os)s".

source: Service not found in services list
id: Layanan tidak ditemukan dalam daftar layanan

source: Set cluster mode
id: Setel mode klaster

source: Some %s processes are not in running state
id: Beberapa proses %s tidak dalam keadaan berjalan

source: Some ZooKeeper processes are not in running state
id: Beberapa proses ZooKeeper tidak dalam kondisi berjalan

source: Specifies CentOS MapR core repository.
id: Menentukan repositori inti CentOS MapR.

source: Specifies CentOS MapR ecosystem repository.
id: Menentukan repositori ekosistem CentOS MapR.

source: Specifies Sentry storage mode.
id: Menentukan mode penyimpanan Sentry.

source: Specifies Ubuntu MapR core repository.
id: Menentukan repositori inti Ubuntu MapR.

source: Specifies Ubuntu MapR ecosystem repository.
id: Menentukan repositori ekosistem Ubuntu MapR.

source: Specifies heap size for MapR-FS in percents of maximum value.
id: Menentukan ukuran tumpukan untuk MapR-FS dalam persen dari nilai maksimum.

source: Specifies that MapR-DB is in use.
id: Menentukan bahwa MapR-DB sedang digunakan.

source: Specifies thrift version.
id: Menentukan thrift version.

source: Specify the version of the service
id: Tentukan versi layanan

source: Start CLDB nodes
id: Mulai node CLDB

source: Start ZooKeepers nodes
id: Mulai node ZooKeepers

source: Start non-CLDB nodes
id: Mulai node non-CLDB

source: Stop Warden nodes
id: Hentikan node Warden

source: Stop ZooKeepers nodes
id: Hentikan node ZooKeepers

source: Template object must be defined
id: Objek template harus ditentukan

source: The MapR Distribution provides a full Hadoop stack that includes the MapR File System (MapR-FS), MapReduce, a complete Hadoop ecosystem, and the MapR Control System user interface
id: MapR Distribution menyediakan Hadoop stack lengkap yang mencakup MapR File System (MapR-FS), MapReduce, ekosistem Hadoop yang lengkap, dan antarmuka pengguna MapR Control System

source: Wait for {node_process} on {instance} to change status to "{status}"
id: Tunggu {node_process} pada {instance} untuk mengubah status menjadi "{status}"

source: Write config files to instances
id: Tulis file config ke instances

source: ZooKeeper is in running state
id: ZooKeeper dalam kondisi berjalan

source: ZooKeeper is not in running state
id: ZooKeeper tidak dalam kondisi berjalan
